# config.py
MY_DICT = {
    # --- Input & Output ---
    "ပြ": "print",
    "ရိုက်ထည့်": "input",
    
    # --- Arithmetic Operators ---
    "ဖြစ်သည်": "=",
    "ပေါင်း": "+",
    "နှုတ်": "-",
    "မြှောက်": "*",
    "စား": "/",
    "အကြွင်း": "%", # Modulo
    "ပါဝါ": "**",   # Power
    
    # --- Control Flow ---
    "မှန်ရင်": "if",
    "ဒါဆို": ":",
    "သို့မဟုတ်ရင်": "elif",
    "မဟုတ်ရင်": "else",
    
    # --- Loops ---
    "အတွက်": "for",
    "စဉ်": "while",
    "အတွင်း": "in",
    "ရပ်": "break",
    "ဆက်လုပ်": "continue",
    
    # --- Logical & Comparison Operators ---
    "နှင့်": "and",
    "သို့မဟုတ်": "or",
    "မဟုတ်": "not",
    "တူသည်": "==",
    "မတူသည်": "!=",
    "ကြီးသည်": ">",
    "ငယ်သည်": "<",
    "ကြီးသို့မဟုတ်တူသည်": ">=",
    "ငယ်သို့မဟုတ်တူသည်": "<=",
    
    # --- Functions & Scope ---
    "လုပ်ဆောင်ချက်": "def",
    "ပြန်ပေး": "return",
    "ကမ္ဘာလုံးဆိုင်ရာ": "global",
    
    # --- Booleans & Data Types ---
    "မှန်": "True",
    "မှား": "False",
    "ဘာမျှမဟုတ်": "None",
    "စာသား": "str",
    "ကိန်း": "int",
    
    # --- Exceptions (Error Handling) ---
    "ကြိုးစား": "try",
    "မှားယွင်း": "except",
    "နောက်ဆုံး": "finally",
    "အမှားထုတ်": "raise",
    
    # --- Others ---
    "တင်သွင်း": "import",
    "အဖြစ်": "as"
}